OpenFOAM/OpenFOAM-7/tutorials/compressible/rhoPimpleFoam/RAS/annularThermalMixer/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication surfaceFeatures

runApplication blockMesh
runApplication snappyHexMesh -overwrite

runApplication createBaffles -overwrite
runApplication mergeOrSplitBaffles -split -overwrite

runApplication $(getApplication)

#------------------------------------------------------------------------------
